date12-03-23.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>3月の記録２</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="3月の記録２"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-26 15:24:52 JST"/>
<meta name="author" content="Yuuhi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./org-mode.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">3月の記録２</h1>

<meta content='no-cache' http-equiv='Pragma' />


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 23日</a>
<ul>
<li><a href="#sec-1-1">1.1 一つタスクを食べた</a></li>
<li><a href="#sec-1-2">1.2 もう少し急げ</a></li>
</ul>
</li>
<li><a href="#sec-2">2 24日</a></li>
<li><a href="#sec-3">3 25日</a></li>
<li><a href="#sec-4">4 26日</a>
<ul>
<li><a href="#sec-4-1">4.1 Rubyのeachとeach<sub>with</sub><sub>index</sub></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 23日</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 一つタスクを食べた</h3>
<div class="outline-text-3" id="text-1-1">

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> もう少し急げ</h3>
<div class="outline-text-3" id="text-1-2">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 24日</h2>
<div class="outline-text-2" id="text-2">

<p>あへあへ
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 25日</h2>
<div class="outline-text-2" id="text-3">

<p>買った．
</p>
<p>
Emacs実践入門　~思考を直感的にコード化し、開発を加速する (WEB+DB PRESS plus) [単行本（ソフトカバー）]<br/>
<a href="http://www.amazon.co.jp/gp/product/4774150029/">http://www.amazon.co.jp/gp/product/4774150029/</a>
</p>
<p>
機能は
</p>



<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;;; </span><span style="color: #ff7f24;">revive.el &#12398;&#35373;&#23450;</span>
(add-to-list 'load-path <span style="color: #ffa07a;">"~/.emacs.d/elisp/revive/"</span>)
(autoload 'save-current-configuration <span style="color: #ffa07a;">"revive"</span> <span style="color: #ffa07a;">"Save status"</span> t)
(autoload 'resume <span style="color: #ffa07a;">"revive"</span> <span style="color: #ffa07a;">"Resume Emacs"</span> t)
(autoload 'wipe <span style="color: #ffa07a;">"revive"</span> <span style="color: #ffa07a;">"Wipe emacs"</span> t)
(define-key ctl-x-map <span style="color: #ffa07a;">"F"</span> 'resume) <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">C-x F &#12391;&#24489;&#20803;</span>
(define-key ctl-x-map <span style="color: #ffa07a;">"K"</span> 'wipe) <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">C-x K &#12391; Kill</span>
(add-hook 'kill-emacs-hook 'save-current-configuration) <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">&#32066;&#20102;&#26178;&#12395;&#20445;&#23384;</span>
(resume) <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">&#36215;&#21205;&#26178;&#12395;&#24489;&#20803;</span>
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 26日</h2>
<div class="outline-text-2" id="text-4">

<p>今日もうねうね
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Rubyのeachとeach<sub>with</sub><sub>index</sub></h3>
<div class="outline-text-3" id="text-4-1">




<pre class="src src-ruby"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">0&#12363;&#12425;10&#12414;&#12391;&#12434;&#34920;&#31034;&#12377;&#12427;&#12503;&#12525;&#12464;&#12521;&#12512;</span>
(0..10).each{|e|
  puts e
}

(0..10).each_with_index{|e,index|
  puts <span style="color: #ffa07a;">"</span><span style="color: #eedd82;">#{index}</span><span style="color: #ffa07a;">&#30058;&#30446;&#12364;</span><span style="color: #eedd82;">#{e}</span><span style="color: #ffa07a;">"</span>
}
</pre>

<p>
インデックスも引数で受け取れる
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-26 15:24:52 JST</p>
<p class="author">Author: Yuuhi</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
